ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/GigaDevice.GD32F1x0_DFP.3.0.1.pdsc
        <!-- *************************  Device 'GD32F150C6'  ***************************** -->
        <device Dname="GD32F150C6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150C8'  ***************************** -->
        <device Dname="GD32F150C8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150G4'  ***************************** -->
        <device Dname="GD32F150G4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150G6'  ***************************** -->
        <device Dname="GD32F150G6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150G8'  ***************************** -->
        <device Dname="GD32F150G8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150K4'  ***************************** -->
        <device Dname="GD32F150K4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150K6'  ***************************** -->
        <device Dname="GD32F150K6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150K8'  ***************************** -->
        <device Dname="GD32F150K8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R4'  ***************************** -->
        <device Dname="GD32F150R4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R6'  ***************************** -->
        <device Dname="GD32F150R6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R8'  ***************************** -->
        <device Dname="GD32F150R8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F170'  **************************** -->
      <subFamily DsubFamily="GD32F170">
        <processor Dclock="48000000"/>
         <compile header="Device/Include/gd32f1x0.h" define="GD32F1x0 USE_STDPERIPH_DRIVER GD32F170_190"/>
        <debug svd="SVD/GD32F1x0.svd"/>
        <book name="Documents/GD32F1x0_User_Manual.pdf" title="GD32F1x0 User Manual"/>
        <book name="Documents/GD32F170xx_Datasheet.pdf" title="GD32F170xx Data Sheet"/>
        <description>
        GD32F170 - ARM Cortex-M3 Core
          Frequency up to 48 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 16KB to 64 KB
          SRAM size from 4KB to 8 KB with HW parity checking
          3KB ISP loader ROM
        </description>
          <feature type="IOs"                   n="55"                                       name="IO pins"/>
          <feature type="I2S"                    n="2"                                        name="I2S"/>
          <feature type="Touch"               n="18"                                      name="Capacitive Touch Inputs"/>
          <feature type="CAN"                 n="2"                                         name="CAN 2.0b Controller"/>
          <feature type="I2C"                   n="3"                                         name="Low-Power I2C"/>
          <feature type="SPI"                    n="3"                                        name="SPI Interface"/>
          <feature type="VCC"                 n="2.5"         m="5.5"                name="Voltage"/>
          <feature type="NVIC"                n="74"                                      name="NVIC"/>
          <feature type="Consumption"                       m="0.0000658"    name="Ultra-Low Power Consumption"/>


